IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/I2C2_I2C2.xml
	<register id="I2C2_ICPID2" acronym="I2C2_ICPID2" offset="0x38" width="32" description="">
		<bitfield id="NU" width="24" begin="31" end="8" resetval="0x0" description="Reserved." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TYPE" width="8" begin="7" end="0" resetval="0x0" description="Identifies the type of peripheral. This value should be 0x05  - (RW  )" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICDMAC" acronym="I2C2_ICDMAC" offset="0x3C" width="32" description="">
		<bitfield id="NU" width="30" begin="31" end="2" resetval="0x0" description="Reserved. - (RW  )" range="31 - 2" rwaccess="RW"/> 
		<bitfield id="TXDMAEN" width="1" begin="1" end="1" resetval="0x0" description="Transmit DMA enable. This bit controls the receive DMA  event pin to the system. When this bit is 1 the DMA event is  enabled and ICTEVT_POR pin is asserted when the DMA  transfer is required. When this bit is 0 the ICTEVT_POR pin  is never asserted.  RXDMAEN=0: DMA transmit event is disabled.  RXDMAEN=1: DMA transmit event is enabled. (Default)" range="1" rwaccess="RW"/> 
		<bitfield id="RXDMAEN" width="1" begin="0" end="0" resetval="0x0" description="Receive DMA enable. This bit controls the receive DMA  event pin to the system. When this bit is 1 the DMA event is  enabled and ICREVT_POR pin is asserted when the DMA  transfer is required. When this bit is 0 the ICREVT_POR  pin is never asserted.  RXDMAEN=0: DMA receive event is disabled.  RXDMAEN=1: DMA receive event is enabled. (Default)" range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_I2C_RESERVED1" acronym="I2C2_I2C_RESERVED1" offset="0x40" width="32" description="">
		<bitfield id="NU" width="32" begin="31" end="0" resetval="0x0" description="Reserved." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C2_I2C_RESERVED2" acronym="I2C2_I2C_RESERVED2" offset="0x44" width="32" description="">
		<bitfield id="NU" width="32" begin="31" end="0" resetval="0x0" description="Reserved." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPFUNC" acronym="I2C2_ICPFUNC" offset="0x48" width="32" description="">
		<bitfield id="NU" width="31" begin="31" end="1" resetval="0x0" description="Reserved." range="31 - 1" rwaccess="RW"/> 
		<bitfield id="PFUNC0" width="1" begin="0" end="0" resetval="0x0" description="Controls the function of the I2C SCL and SDA pins.  0 = Pins function as SCL and SDA  1 = Pins functions as GPIO  Note: No hardware protection is required to disable I2C  function when the PFUNC[0] and IRS_ bits are both set to  one. When PFUNC[0] is'1' (GPIO mode) the sub-module  which controls the I2C function receives the value'1' for  SCL  and SDA. IRS_ can be set to'1' regardless of PFUNC[0]  and the I2C function works whenever the IRS_ bit is'1'. The  user is expected to hold I2C in reset via IRS_ bit when  changing to/from GPIO mode via the PFUNC[0] bit." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPDIR" acronym="I2C2_ICPDIR" offset="0x4C" width="32" description="">
		<bitfield id="PDIR1" width="1" begin="1" end="1" resetval="0x0" description="Controls the direction of the I2C SDA pin when configured as  GPIO.  0 = SDA pin functions as input  1 = SDA pin functions as output" range="1" rwaccess="RW"/> 
		<bitfield id="PDIR0" width="1" begin="0" end="0" resetval="0x0" description="Controls the direction of the I2C SCL pin when configured as  GPIO.  0 = SCL pin functions as input  1 = SCL pin functions as output" range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPDIN" acronym="I2C2_ICPDIN" offset="0x50" width="32" description="">
		<bitfield id="PDIN1" width="1" begin="1" end="1" resetval="0x0" description="Indicates the logic level present on the SDA pin.  Reads:  0 = Logic low present at SDA pin regardless of PFUNC  setting.  1 = Logic high present at SDA pin regardless of PFUNC  setting.  Writes:  Writes have no effect. - (RW  )" range="1" rwaccess="RW"/> 
		<bitfield id="PDIN0" width="1" begin="0" end="0" resetval="0x0" description="Indicates the logic level present on the SCL pin.  Reads:  0 = Logic low present at SCL pin regardless of PFUNC  setting.  1 = Logic high present at SCL pin regardless of PFUNC  setting.  Writes:  Writes have no effect - (RW  )" range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPDOUT" acronym="I2C2_ICPDOUT" offset="0x54" width="32" description="">
		<bitfield id="PDOUT1" width="1" begin="1" end="1" resetval="0x0" description="Controls the level driven on the SDA pin when configured as  GPIO output.  Reads:  Reads return register values not GPIO pin levels.  Writes:  0 = SDA pin driven low  1 = SDA pin driven high.  Note: If SDA is connected to an open-drain buffer at the  chiplevel  the I2C cannot drive SDA to high." range="1" rwaccess="RW"/> 
		<bitfield id="PDOUT0" width="1" begin="0" end="0" resetval="0x0" description="Controls the level driven on the SCL pin when configured as  GPIO output.  Reads:  Reads return register values not GPIO pin levels.  Writes:  0 = SCL pin driven low  1 = SCL pin driven high  Note: If SCL is connected to an open-drain buffer at the  chiplevel  the I2C cannot drive SCL to high." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPDSET" acronym="I2C2_ICPDSET" offset="0x58" width="32" description="">
		<bitfield id="PDSET1" width="1" begin="1" end="1" resetval="0x0" description="Used to set PDOUT[1] bit which corresponds to the SDA GPIO  pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[1] bit is set to logic high." range="1" rwaccess="RW"/> 
		<bitfield id="PDSET0" width="1" begin="0" end="0" resetval="0x0" description="Used to set PDOUT[0] bit which corresponds to the SCL GPIO  pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[0] bit is set to logic high." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPDCLR" acronym="I2C2_ICPDCLR" offset="0x5C" width="32" description="">
		<bitfield id="PDCLR1" width="1" begin="1" end="1" resetval="0x0" description="Used to clear PDOUT[1] bit which corresponds to the SDA pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[1] bit is cleared to logic low." range="1" rwaccess="RW"/> 
		<bitfield id="PDCLR0" width="1" begin="0" end="0" resetval="0x0" description="Used to clear PDOUT[0] bit which corresponds to the SCL pin.  Reads:  Reads should return 0. User documentation should say reads  are indeterminate.  Writes:  0 = no effect  1 = PDOUT[0] bit is cleared to logic low." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C2_ICPDRV" acronym="I2C2_ICPDRV" offset="0x60" width="32" description="">
		<bitfield id="PDRV1" width="1" begin="1" end="1" resetval="0x0" description="Used to select driver mode of output buffer for SDA pin.  0 = I2C mode.   1 = GPIO mode. Note: Value of this register is reflected on the  PDRV_SDA_POR port. Actual function depends on I/O buffer and  chip implementation." range="1" rwaccess="RW"/> 
		<bitfield id="PDRV0" width="1" begin="0" end="0" resetval="0x0" description="Used to select driver mode of output buffer for SCL pin.  0 = I2C mode. 1 = GPIO mode. Note: Value of this register is reflected on the  PDRV_SCL_POR port. Actual function depends on I/O buffer  and chip implementation." range="0" rwaccess="RW"/>
	</register>
</module>